Tutorial/Rigid_Case/backGround/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("liboverset.so");

application     overPimpleDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;
//stopAt	writeNow;

endTime         25;

deltaT          1e-3;

writeControl    adjustable;

writeInterval   0.1;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;
maxCo           0.5;
maxDeltaT       0.01;

// ************************************************************************* //

functions
{
///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////

    forces_object
    {
	type forces;
	libs ("libforces.so");
	writeControl   timeStep;
	writeInterval  100;
	patches ("wing");
	pName p;
	Uname U;
	rho rhoInf;
	rhoInf 1.225;
	CofR (0 0 0);
    }
///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////
    forceCoeffs_object
    {
	type forceCoeffs;
	libs ("libforces.so");
	patches (wing);
	pName p;
	Uname U;
	rho rhoInf;
	rhoInf 1.225;
	log true;
	CofR (0.0 0 0);
	liftDir (-0.173648 0.984807 0);
	dragDir (0.984807 0.173648 0);
	pitchAxis (0 0 1);
	magUInf 14.6;
	lRef 1.0;
	Aref 1.0;
        writeControl   timeStep;
        writeInterval  10;
    }
///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////
};

